DataProcessors/КопированиеНастроекСчетаДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>КопированиеНастроекСчетаДоверительногоУправления</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КлиентыДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КлиентыДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлиентыДоверительногоУправления</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПоВидуУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПоВидуУчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВключатьРасходыПоПокупкеВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыделятьРасходыПриПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодОценкиСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОценкиСтоимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписыватьКупленныйКупонПриЧастичномПогашенииОблигации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьРасчетаСтоимостиПартий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПартииРЕПООтдельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешеноОткрыватьКороткиеПозиции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодОпределенияДоходовИРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОпределенияДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПогрешностьОкругленияНаПартиях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПогрешностьОкругленияНаПартияхВВалютеУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодУчетаПогрешностиОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыУчетаПогрешностиОкругления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодикаПерекурсовкиВалютныхАктивовИОбязательств</Name>
					<Comment>#540061</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.МетодикиПерекурсовкиВалютныхАктивовИОбязательств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьПерекурсовкиВалютныхАктивовИОбязательств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерекурсовыватьВНерабочиеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьИндексацииНоминала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексироватьНоминалВНерабочиеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьПерекурсовкиБумагВЗалоге</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерекурсовыватьВалютныеАктивыВМоментОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодПризнанияРасходовПоСделкамРЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыПризнанияРасходовПоСделкам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьЗадолженностьПоКупонуВЗалогеНаСчетеПогашенияКупона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаПроцентовПоСделкамРЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаПроцентовПоСделкамРЕПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверятьСтавкуРЕПОнаРыночность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантУчетаИндексацииНоминала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаИндексированногоНоминала</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоцениватьАктивыПередВыводом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьПроцентныеДоходыПоВыводимымАктивам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПогрешностьСложенияБрокерскойИТорговойКомиссийПоРЕПО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПогрешностьОкругленияПриПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоцениватьАктивыПередПродажей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоцениватьПриобретенныеАктивы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьПереоценкиЗадолженностей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодПризнанияРасходовПоБиржевымДепозитам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыПризнанияРасходовПоСделкам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьПерекурсовкиЦенныхБумаг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПериодичностиПерекурсовкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантВзятияКурсаВалютныхБумагПриСделкахВРубляхДляРасчетаСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантВзятияКурсаВалютныхБумагПриСделкахВРубляхДляРасчетаСтоимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиУчетаАктивовЕПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаАктивовЕПС</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодичностьПереоценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоцениватьВДеньОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереоцениватьВНерабочиеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьНачисленияПроцентныхДоходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьНачисленияКорректировкиЭСП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьПроцентныеДоходыВДеньОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьПроцентныеДоходыВНерабочиеДни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтноситьРасходыПриПокупкеНаПремию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьКорректировкуЭСПВДеньОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервОКУПриПервоначальномПризнании</Name>
					<Comment>#538027</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписыватьРезервОКУНаДатуПрекращенияПризнания</Name>
					<Comment>#538027</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаНачисленияРезервов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаСписанияРезервов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчетныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиЗакрытияБухгалтерскихСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиЗакрытияБухгалтерскихСчетов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗакрыватьПриПоступленииДенежныхСредств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьЗакрытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантЗакрытияБухгалтерскихСчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыЗакрытияБухгалтерскихСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскийУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыйУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйБухгалтерскийУчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/КопированиеНастроекСчетаДоверительногоУправления/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьНастройкиПоУмолчанию();
	ЭтаФорма.ПодтверждениеПереноса = Ложь;

	ЭтаФорма.Детализировать = Истина;
	ЭтаФорма.Элементы.НастройкиДетализации.Видимость = ЭтаФорма.Детализировать;   
	
	ЭтаФорма.НастройкиБЭКПеренесены = Ложь;
	ЭтаФорма.НастройкиБУХПеренесены = Ложь;
	
	Элементы.НастройкиБЭКПеренесены.ЦветТекста = WebЦвета.Красный;
	Элементы.НастройкиБУХПеренесены.ЦветТекста = WebЦвета.Красный;
	
	Если ЭтотОбъект.ЭтоНовыйСчетДУ Тогда
		//Предварительный перенос настроек. ПодтверждениеПереноса = Ложь
		// настройки не будут перенесены, сфомируется таблица с ожидаемыми результатами 
		
		Элементы.БЭК.Доступность = Ложь;
		Элементы.БУХ.Доступность = Ложь;
		
		Если ПроверитьПараметрыПереноса() Тогда
			СкопироватьНастройкиБЭК(Команды.Найти("СкопироватьНастройкиБЭК"));
			СкопироватьНастройкиБУХ(Команды.Найти("СкопироватьНастройкиБУХ"));
		КонецЕсли;
				
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	//БЭКофисный учет
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиЦелейРасчета);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиФормированияСЧА);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиФормированияСЧАПоВидамЗадолженности);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаБенчмарков);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаВознагражденияУправляющего);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаПлановойДоходности);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.СоставИНастройкиОтчетов);
	ДобавитьРегистрНастроекНаСервере(Метаданные.РегистрыСведений.ЗначенияДополнительныхСведений);
	
	Если Параметры.Свойство("СчетРеципиент") Тогда
		ЭтотОбъект.СчетРеципиент = Параметры.СчетРеципиент; 
	КонецЕсли;
	
	Если Параметры.Свойство("СчетДонор") Тогда
		ЭтотОбъект.СчетДонор = Параметры.СчетДонор; 
	КонецЕсли;

	Если Параметры.Свойство("ДатаВзятия") Тогда
		ЭтотОбъект.ДатаВзятия = Параметры.ДатаВзятия; 
	КонецЕсли;

	Если Параметры.Свойство("ДатаУстановки") Тогда
		ЭтотОбъект.ДатаУстановки = Параметры.ДатаУстановки; 
	КонецЕсли;

	Если Параметры.Свойство("ЭтоНовыйСчетДУ") Тогда
		ЭтотОбъект.ЭтоНовыйСчетДУ = Параметры.ЭтоНовыйСчетДУ; 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСчетаИлиДаты(Элемент)
	
	ЗаполнитьНастройкиПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиПоУмолчанию()
	
	Если ЗначениеЗаполнено(ДатаВзятия) Тогда
		СписокПараметров = ПолучитьСписокПараметровНаСервере();
	Иначе 	            
		СписокПараметров = Неопределено;
	КонецЕсли;
	
	ПроставитьНастройкиПереноса(СписокПараметров);
	ПроставитьДоступностьНастроекПереноса(СписокПараметров);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)  
	
	РезультатПереносаНастроек = ПолучитьРезультатПереносаНастроек();
	ОповеститьОВыборе(РезультатПереносаНастроек);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРезультатПереносаНастроек()
	
	РезультатПереносаНастроек = Новый Структура;
	РезультатПереносаНастроек.Вставить("НастройкиБЭКПеренесены", ЭтаФорма.НастройкиБЭКПеренесены);
	РезультатПереносаНастроек.Вставить("НастройкиБУХПеренесены", ЭтаФорма.НастройкиБУХПеренесены);
	РезультатПереносаНастроек.Вставить("СчетДонор", ЭтаФорма.СчетДонор);
	РезультатПереносаНастроек.Вставить("ДатаВзятия", Формат(ЭтаФорма.ДатаВзятия, "ДФ=dd.MM.yyyy"));
	РезультатПереносаНастроек.Вставить("ДатаУстановки", Формат(ЭтаФорма.ДатаУстановки, "ДФ=dd.MM.yyyy"));
	РезультатПереносаНастроек.Вставить("Отчет", ЭтаФорма.Отчет);
	
	Возврат РезультатПереносаНастроек;
	
КонецФункции    

&НаКлиенте
Процедура ПодтвердитьПереносИЗакрыть(Команда) 
	
	// для сотрудников БЭК у которых нет доступа к операциям БУХ. 
	// если счет донор заполнен и устраивает.  
	// команда доступна только для нового элемента Счета ДУ. 
	ЭтаФорма.ПодтверждениеПереноса = Истина;
	Если ПроверитьПараметрыПереноса() Тогда
		СкопироватьНастройкиБЭК(Команды.Найти("СкопироватьНастройкиБЭК"));
		СкопироватьНастройкиБУХ(Команды.Найти("СкопироватьНастройкиБУХ")); 
		ЭтаФорма.Закрыть(); 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПроверитьПараметрыПереноса()

    ПереносВозможен = Истина;
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.СчетДонор) Тогда 
		ПереносВозможен = Ложь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.СчетРеципиент) Тогда 
		ПереносВозможен = Ложь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.ДатаВзятия) Тогда 
		ПереносВозможен = Ложь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.ДатаУстановки) Тогда 
		ПереносВозможен = Ложь;
	КонецЕсли;
	
	Если Не ПереносВозможен Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проверьте заполнение реквизитов переноса");
	КонецЕсли;
	
	Возврат ПереносВозможен;
	
КонецФункции


#Область ПереносБухгалтерия

&НаСервере
Функция ПолучитьСписокПараметровНаСервере()
	
	Если НЕ (ЗначениеЗаполнено(ЭтаФорма.СчетДонор) И ЗначениеЗаполнено(ЭтаФорма.СчетРеципиент)) Тогда
		Возврат Неопределено;
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Донор.ВестиБухгалтерскийУчет
		|		И ЕСТЬNULL(Реципиент.ВестиБухгалтерскийУчет, ИСТИНА) КАК ВестиБухгалтерскийУчет,
		|	Донор.ВестиЕдиныйБухгалтерскийУчет
		|		И ЕСТЬNULL(Реципиент.ВестиЕдиныйБухгалтерскийУчет, ИСТИНА) КАК ВестиЕдиныйБухгалтерскийУчет,
		|	Донор.ВестиНалоговыйУчет
		|		И ЕСТЬNULL(Реципиент.ВестиНалоговыйУчет, ИСТИНА) КАК ВестиНалоговыйУчет,
		|	КлиентыДоверительногоУправленияДонор.Клиент КАК КлиентДонор,
		|	КлиентыДоверительногоУправленияРеципиент.Клиент КАК КлиентРеципиент
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕСТЬNULL(НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет, ЛОЖЬ) КАК ВестиБухгалтерскийУчет,
		|		ЕСТЬNULL(НастройкиУчетаОбщиеСрезПоследних.ВестиЕдиныйБухгалтерскийУчет, ЛОЖЬ) КАК ВестиЕдиныйБухгалтерскийУчет,
		|		ЕСТЬNULL(НастройкиУчетаОбщиеСрезПоследних.ВестиНалоговыйУчет, ЛОЖЬ) КАК ВестиНалоговыйУчет
		|	ИЗ
		|		РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(&ДатаВзятия, СчетДоверительногоУправления = &СчетДонор) КАК НастройкиУчетаОбщиеСрезПоследних) КАК Донор
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЕСТЬNULL(НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет, ЛОЖЬ) КАК ВестиБухгалтерскийУчет,
		|			ЕСТЬNULL(НастройкиУчетаОбщиеСрезПоследних.ВестиЕдиныйБухгалтерскийУчет, ЛОЖЬ) КАК ВестиЕдиныйБухгалтерскийУчет,
		|			ЕСТЬNULL(НастройкиУчетаОбщиеСрезПоследних.ВестиНалоговыйУчет, ЛОЖЬ) КАК ВестиНалоговыйУчет
		|		ИЗ
		|			РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(&ДатаУстановки, СчетДоверительногоУправления = &СчетРеципиент) КАК НастройкиУчетаОбщиеСрезПоследних) КАК Реципиент
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаВзятия, СчетДоверительногоУправления = &СчетДонор) КАК КлиентыДоверительногоУправленияДонор
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаУстановки, СчетДоверительногоУправления = &СчетРеципиент) КАК КлиентыДоверительногоУправленияРеципиент
		|		ПО (ИСТИНА)";
	
	Запрос.УстановитьПараметр("ДатаВзятия", ЭтаФорма.ДатаВзятия);
	Запрос.УстановитьПараметр("СчетДонор", ЭтаФорма.СчетДонор);
	Запрос.УстановитьПараметр("ДатаУстановки", ЭтаФорма.ДатаУстановки);
	Запрос.УстановитьПараметр("СчетРеципиент", ЭтаФорма.СчетРеципиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		
		СписокПараметров = Новый Структура;
		СписокПараметров.Вставить("ВестиБухгалтерскийУчет", Выборка.ВестиБухгалтерскийУчет);
		СписокПараметров.Вставить("ВестиЕдиныйБухгалтерскийУчет", Выборка.ВестиЕдиныйБухгалтерскийУчет);
		СписокПараметров.Вставить("ВестиНалоговыйУчет", Выборка.ВестиНалоговыйУчет);
		СписокПараметров.Вставить("КлиентДонор", Выборка.КлиентДонор);
		СписокПараметров.Вставить("КлиентРеципиент", Выборка.КлиентРеципиент);
		
		ЭтаФорма.КлиентДонор = Выборка.КлиентДонор;
		ЭтаФорма.КлиентРеципиент = Выборка.КлиентРеципиент; 
				
		Возврат СписокПараметров;
			
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У донорского счета ДУ нет настроек учета на указанную дату!");
		
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции	

&НаКлиенте
Процедура СкопироватьНастройкиБУХ(Команда)
	
	
	Если ЭтаФорма.ОграничениеПоВидуАктива И
		НЕ ЗначениеЗаполнено(ЭтаФорма.УчетныйАктив) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните учетный актив, для которого вы хотите перенести настройки",,УчетныйАктив);
		Возврат;
	КонецЕсли;  
	
	ПереносНаСервере();
	
	Если ПодтверждениеПереноса Тогда
		ЭтаФорма.НастройкиБУХПеренесены = Истина;
		Элементы.НастройкиБУХПеренесены.ЦветТекста = WebЦвета.Зеленый; 
		Элементы.СкопироватьНастройкиБУХ.Доступность = Ложь; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПереносНастроекПоРегистру(ИмяРегистра, ФильтрПоВидуУчета = "", ОтборУчетныйАктив = Неопределено, Отказ, Расшифровка)
	
	ПолеПриемника = ПолучитьПолеПриемникаРегистраНастроек(ИмяРегистра);
	
	СвойстваПриемника = Новый Структура;
	СвойстваПриемника.Вставить("Период",		ЭтотОбъект.ДатаУстановки);
	СвойстваПриемника.Вставить("Организация",	ЭтотОбъект.СчетРеципиент.Организация);
	СвойстваПриемника.Вставить(ПолеПриемника,	ЭтотОбъект.СчетРеципиент); 
	
	ИсключаяСвойства = ИсключаемыеИзКопированияСвойстваРегистраНастроек(ИмяРегистра);
	
	
	ОчищатьСтарыеНастройки = Истина;
	Если ЭтаФорма.НеУдалятьСтарыеНастройки Тогда
	    // возможно, что уже есть значения на ДатаУстановки - почистим
		ЗаписиКУдалению = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
		
		ЗаписиКУдалению.Отбор.Период.Установить(ЭтаФорма.ДатаУстановки);
		ЗаписиКУдалению.Отбор.Организация.Установить(ПараметрыСеанса.ТекущаяОрганизация);
		ЗаписиКУдалению.Отбор.СчетДоверительногоУправления.Установить(ЭтаФорма.СчетРеципиент); 
		Если ИмяРегистра = "НастройкиУчетаАктивов" И ОтборУчетныйАктив <> Неопределено Тогда 
			ЗаписиКУдалению.Отбор.УчетныйАктив.Установить(ОтборУчетныйАктив);
		КонецЕсли;
				
		Если ФильтрПоВидуУчета <> "" Тогда
			ЗаписиКУдалению.Отбор.ВидУчета.Установить(ФильтрПоВидуУчета);
		КонецЕсли;
		
		Попытка
			ЗаписиКУдалению.Прочитать();
			ЗаписиКУдалению.Очистить();  
			Если ПодтверждениеПереноса Тогда
				ЗаписиКУдалению.Записать(); 
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		ОчищатьСтарыеНастройки = Ложь;
	КонецЕсли;
	
	ЗаписиПриемник = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	ЗаписиПриемник.Отбор.Организация.Установить(ПараметрыСеанса.ТекущаяОрганизация);
	ЗаписиПриемник.Отбор.СчетДоверительногоУправления.Установить(ЭтаФорма.СчетРеципиент); 
	Если ИмяРегистра = "НастройкиУчетаАктивов" И ОтборУчетныйАктив <> Неопределено Тогда 
		ЗаписиПриемник.Отбор.УчетныйАктив.Установить(ОтборУчетныйАктив);
	КонецЕсли;
	
	Если ФильтрПоВидуУчета <> "" Тогда
		ЗаписиПриемник.Отбор.ВидУчета.Установить(ФильтрПоВидуУчета);
	КонецЕсли;
	
	Попытка
		ЗаписиПриемник.Прочитать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	Если ОчищатьСтарыеНастройки Тогда
		ЗаписиПриемник.Очистить();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Если ИмяРегистра = "НастройкиУчетаАктивов" И ОтборУчетныйАктив <> Неопределено Тогда 
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Настройки.*
		|ИЗ
		|	РегистрСведений.%ИмяРегистра%.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления И УчетныйАктив В (&ОтборУчетныйАктив)) КАК Настройки"; 
		
		Запрос.УстановитьПараметр("ОтборУчетныйАктив", ОтборУчетныйАктив);
	Иначе	
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Настройки.*
		|ИЗ
		|	РегистрСведений.%ИмяРегистра%.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК Настройки"; 
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяРегистра%", ИмяРегистра);
	
	Запрос.УстановитьПараметр("Период", ЭтаФорма.ДатаВзятия);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтаФорма.СчетДонор);
	
	Если ФильтрПоВидуУчета <> "" Тогда
		Запрос.УстановитьПараметр("ВидУчета", ФильтрПоВидуУчета);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Период,", "&Период, ВидУчета = &ВидУчета И");
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		СтрокаЗаписиПриемник = ЗаписиПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗаписиПриемник, ВыборкаДетальныеЗаписи);
		СтрокаЗаписиПриемник.СчетДоверительногоУправления = ЭтаФорма.СчетРеципиент;
		СтрокаЗаписиПриемник.Организация = ЭтаФорма.СчетРеципиент.Организация;
		Если ФильтрПоВидуУчета <> "" Тогда
			СтрокаЗаписиПриемник.ВидУчета = ФильтрПоВидуУчета;
		КонецЕсли;
		СтрокаЗаписиПриемник.Период = ЭтаФорма.ДатаУстановки;  
		
		Если ИмяРегистра = "НастройкиУчетаАктивов" И ЭтаФорма.ДатаУстановки > Дата(2025, 1, 1) Тогда
			Если СтрокаЗаписиПриемник.ВидУчета = Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет 
				И СтрокаЗаписиПриемник.УчетныйАктив = Справочники.УчетныеАктивы.Паи 
				И СтрокаЗаписиПриемник.КлассификацияАктиваПоСрочности = Справочники.КлассификаторАктивовПоСрочности.СвышеГода Тогда
				СтрокаЗаписиПриемник.КлассификацияАктиваПоСрочности = Справочники.КлассификаторАктивовПоСрочности.СвышеПятиЛет;  
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вид учета Единый бухгалтерский учет, вид актива Паи: Классификация актива по срочности 'Свыше года' заменена на 'Свыше пяти лет'");
			КонецЕсли;
		КонецЕсли;

		ДобавитьРасшифровкуОперации(Расшифровка, ЭтаФорма.СчетРеципиент, ИмяРегистра, ВыборкаДетальныеЗаписи, СвойстваПриемника, ИсключаяСвойства, Ложь, "");
		
	КонецЦикла;
	
	Попытка
		Если ПодтверждениеПереноса Тогда
			ЗаписиПриемник.Записать();
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
		Отказ = Истина;
		Возврат;
	КонецПопытки;   

КонецПроцедуры

&НаСервере
Процедура ПереносНастроекПоРегиструПереопределениеКлассификации(Отказ, Расшифровка)
	// версия процедуры  ПереносНастроекПоРегистру()
	// нет измерения Счет доверительного управления, есть измерение Клиент
	// не нужен фильтр на вид учета  
	
	ПолеПриемника = ПолучитьПолеПриемникаРегистраНастроек("ПереопределениеКлассификацииУчетныхАктивовЦБ");
	
	СвойстваПриемника = Новый Структура;
	СвойстваПриемника.Вставить("Период",		ЭтотОбъект.ДатаУстановки);
	СвойстваПриемника.Вставить("Организация",	ЭтотОбъект.СчетРеципиент.Организация);
	СвойстваПриемника.Вставить(ПолеПриемника,	ЭтотОбъект.КлиентРеципиент); 
	
	ИсключаяСвойства = ИсключаемыеИзКопированияСвойстваРегистраНастроек("ПереопределениеКлассификацииУчетныхАктивовЦБ");
	
	
	ОчищатьСтарыеНастройки = Истина;
	Если ЭтаФорма.НеУдалятьСтарыеНастройки Тогда
	    // возможно, что уже есть значения на ДатаУстановки - почистим
		ЗаписиКУдалению = РегистрыСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СоздатьНаборЗаписей();
		
		ЗаписиКУдалению.Отбор.Период.Установить(ЭтаФорма.ДатаУстановки);
		ЗаписиКУдалению.Отбор.Организация.Установить(ПараметрыСеанса.ТекущаяОрганизация);
		ЗаписиКУдалению.Отбор.Клиент.Установить(ЭтаФорма.КлиентРеципиент);
		
		Попытка
			ЗаписиКУдалению.Прочитать();
			ЗаписиКУдалению.Очистить(); 
			Если ПодтверждениеПереноса Тогда
				ЗаписиКУдалению.Записать(); 
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		ОчищатьСтарыеНастройки = Ложь;
	КонецЕсли;
	
	ЗаписиПриемник = РегистрыСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СоздатьНаборЗаписей();
	
	ЗаписиПриемник.Отбор.Организация.Установить(ПараметрыСеанса.ТекущаяОрганизация);
	ЗаписиПриемник.Отбор.Клиент.Установить(ЭтаФорма.КлиентРеципиент);
	
	Попытка
		ЗаписиПриемник.Прочитать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	Если ОчищатьСтарыеНастройки Тогда
		ЗаписиПриемник.Очистить();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Настройки.*
		|ИЗ
		|	РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(&Период, Клиент = &Клиент И Организация = &Организация) КАК Настройки";
	
	
	Запрос.УстановитьПараметр("Период", ЭтаФорма.ДатаВзятия);
	Запрос.УстановитьПараметр("Клиент", ЭтаФорма.КлиентДонор);
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.СчетДонор.Организация);
		
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		СтрокаЗаписиПриемник = ЗаписиПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗаписиПриемник, ВыборкаДетальныеЗаписи);
		СтрокаЗаписиПриемник.Клиент = ЭтаФорма.КлиентРеципиент;
		СтрокаЗаписиПриемник.Организация = ЭтаФорма.СчетРеципиент.Организация;
		СтрокаЗаписиПриемник.Период = ЭтаФорма.ДатаУстановки;   
		
		ДобавитьРасшифровкуОперации(Расшифровка, ЭтаФорма.СчетРеципиент, "ПереопределениеКлассификацииУчетныхАктивовЦБ", ВыборкаДетальныеЗаписи, СвойстваПриемника, ИсключаяСвойства, Ложь, "");
		
	КонецЦикла;
	
	Попытка 
		Если ПодтверждениеПереноса Тогда
			ЗаписиПриемник.Записать();
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	ОчищатьСтарыеНастройки = Истина;
	Если ЭтаФорма.НеУдалятьСтарыеНастройки Тогда
	    // возможно, что уже есть значения на ДатаУстановки - почистим
		ЗаписиКУдалению = РегистрыСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СоздатьНаборЗаписей();
		
		ЗаписиКУдалению.Отбор.Период.Установить(ЭтаФорма.ДатаУстановки);
		ЗаписиКУдалению.Отбор.Организация.Установить(ПараметрыСеанса.ТекущаяОрганизация);
		ЗаписиКУдалению.Отбор.Клиент.Установить(ЭтаФорма.КлиентРеципиент);
		
		Попытка
			ЗаписиКУдалению.Прочитать();
			ЗаписиКУдалению.Очистить();
			Если ПодтверждениеПереноса Тогда
				ЗаписиКУдалению.Записать();
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		ОчищатьСтарыеНастройки = Ложь;
	КонецЕсли;
	
	ЗаписиПриемник = РегистрыСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СоздатьНаборЗаписей();
	
	ЗаписиПриемник.Отбор.Организация.Установить(ПараметрыСеанса.ТекущаяОрганизация);
	ЗаписиПриемник.Отбор.Клиент.Установить(ЭтаФорма.КлиентРеципиент);
	
	Попытка
		ЗаписиПриемник.Прочитать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	Если ОчищатьСтарыеНастройки Тогда
		ЗаписиПриемник.Очистить();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Настройки.*
		|ИЗ
		|	РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ.СрезПоследних(&Период, Клиент = &Клиент И Организация = &Организация) КАК Настройки";
	
	
	Запрос.УстановитьПараметр("Период", ЭтаФорма.ДатаВзятия);
	Запрос.УстановитьПараметр("Клиент", ЭтаФорма.КлиентДонор);
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.СчетДонор.Организация);
		
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		СтрокаЗаписиПриемник = ЗаписиПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗаписиПриемник, ВыборкаДетальныеЗаписи);
		СтрокаЗаписиПриемник.Клиент = ЭтаФорма.КлиентРеципиент;
		СтрокаЗаписиПриемник.Организация = ЭтаФорма.СчетРеципиент.Организация;
		СтрокаЗаписиПриемник.Период = ЭтаФорма.ДатаУстановки;
		
	КонецЦикла;
	
	Попытка 
		Если ПодтверждениеПереноса Тогда
			ЗаписиПриемник.Записать();
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());	
		Отказ = Истина;
		Возврат;
	КонецПопытки;
		
КонецПроцедуры	

&НаСервере
Процедура ПереносНаСервере()

	Отказ = Ложь; 
	
	ОрганизацияПриемника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетРеципиент, "Организация");
	
	//СвойстваПриемника = Новый Структура;
	//СвойстваПриемника.Вставить("Период",		ДатаУстановки);
	//СвойстваПриемника.Вставить("Организация",	ОрганизацияПриемника);
	//СвойстваПриемника.Вставить(ПолеПриемника,	СчетРеципиент);

	Если ПустаяСтрока(Адрес_Расшифровка) Тогда
		Расшифровка = Новый Структура;   
	Иначе
		Расшифровка = ПолучитьИзВременногоХранилища(Адрес_Расшифровка);
	КонецЕсли;
	
	Если ПараметрыСеанса.ТекущаяОрганизация <> СчетРеципиент.Организация Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Текущая организация должна быть равна организации счета-приёмника");
		Возврат;
		
	КонецЕсли;
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
		// блокировка
		БлокировкаДанных = Новый БлокировкаДанных;
		
		Если ЭтаФорма.Общие Тогда
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.НастройкиУчетаОбщие");
			ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтаФорма.СчетРеципиент);
		КонецЕсли;
		
		Если ЭтаФорма.ПоВидуЕПС ИЛИ ЭтаФорма.ПоВидуБУ ИЛИ ЭтаФорма.ПоВидуНУ Тогда
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.НастройкиПоВидуУчета");
			ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтаФорма.СчетРеципиент);
		КонецЕсли;
		
		Если ЭтаФорма.АктивыЕПС Тогда
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.НастройкиУчетаАктивовЕПС");
			ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтаФорма.СчетРеципиент);
		КонецЕсли;
		
		Если ЭтаФорма.АктивыБУ ИЛИ ЭтаФорма.АктивыНУ ИЛИ ЭтаФорма.АктивыПоСрочности Тогда
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.НастройкиУчетаАктивов");
			ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтаФорма.СчетРеципиент);
		КонецЕсли;
		
		Если ЭтаФорма.КомиссияЕПС ИЛИ ЭтаФорма.КомиссияБУ ИЛИ ЭтаФорма.КомиссияНУ Тогда
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.НастройкиУчетаКомиссии");
			ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтаФорма.СчетРеципиент);
		КонецЕсли;
		
		Если ЭтаФорма.ЗакрытиеЕПС ИЛИ ЭтаФорма.ЗакрытиеБУ ИЛИ ЭтаФорма.ЗакрытиеНУ Тогда
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.НастройкиЗакрытияБухгалтерскихСчетов");
			ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтаФорма.СчетРеципиент);
		КонецЕсли;
		
		Если ЭтаФорма.ПереопределениеКлассификации Тогда 
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ПереопределениеКлассификацииУчетныхАктивовЦБ");
			ЭлементБлокировкиДанных.УстановитьЗначение("Клиент", ЭтаФорма.КлиентРеципиент);
		КонецЕсли;	
		
		БлокировкаДанных.Заблокировать();
	
	
		Если ЭтаФорма.Общие Тогда
			ПереносНастроекПоРегистру("НастройкиУчетаОбщие", , , Отказ, Расшифровка);
		КонецЕсли;
		
		Если ЭтаФорма.ПоВидуЕПС Тогда
			ПереносНастроекПоРегистру("НастройкиПоВидуУчета", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, , Отказ, Расшифровка);
		КонецЕсли;
		Если ЭтаФорма.ПоВидуБУ Тогда
			ПереносНастроекПоРегистру("НастройкиПоВидуУчета", Перечисления.ВидыУчета.БухгалтерскийУчет, , Отказ, Расшифровка);
		КонецЕсли;
		Если ЭтаФорма.ПоВидуНУ Тогда
			ПереносНастроекПоРегистру("НастройкиПоВидуУчета", Перечисления.ВидыУчета.НалоговыйУчет, , Отказ, Расшифровка);
		КонецЕсли;
		
		Если ЭтаФорма.АктивыЕПС Тогда
			ПереносНастроекПоРегистру("НастройкиУчетаАктивовЕПС",,, Отказ, Расшифровка);
		КонецЕсли;
		Если ЭтаФорма.АктивыБУ Тогда
			Если НЕ ЭтаФорма.ОграничениеПоВидуАктива Тогда 
				ПереносНастроекПоРегистру("НастройкиУчетаАктивов", Перечисления.ВидыУчета.БухгалтерскийУчет, , Отказ, Расшифровка);
			Иначе 
				Для Каждого Элемент из ЭтаФорма.УчетныйАктив Цикл
					ПереносНастроекПоРегистру("НастройкиУчетаАктивов", Перечисления.ВидыУчета.БухгалтерскийУчет, Элемент.Значение, Отказ, Расшифровка);
				КонецЦикла
			КонецЕсли;
		КонецЕсли;
		Если ЭтаФорма.АктивыНУ Тогда   
			Если НЕ ЭтаФорма.ОграничениеПоВидуАктива Тогда 
				ПереносНастроекПоРегистру("НастройкиУчетаАктивов", Перечисления.ВидыУчета.НалоговыйУчет, , Отказ, Расшифровка);
			Иначе 
				Для Каждого Элемент из ЭтаФорма.УчетныйАктив Цикл
					ПереносНастроекПоРегистру("НастройкиУчетаАктивов", Перечисления.ВидыУчета.НалоговыйУчет, Элемент.Значение, Отказ, Расшифровка);
				КонецЦикла
			КонецЕсли;
		КонецЕсли;
		Если ЭтаФорма.АктивыПоСрочности Тогда 
			ПереносНастроекПоРегистру("НастройкиУчетаАктивов", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, , Отказ, Расшифровка);
		КонецЕсли;	
		Если ЭтаФорма.ПереопределениеКлассификации Тогда 
			ПереносНастроекПоРегиструПереопределениеКлассификации(Отказ, Расшифровка);
		КонецЕсли;
		
		Если ЭтаФорма.КомиссияЕПС Тогда
			ПереносНастроекПоРегистру("НастройкиУчетаКомиссии", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, , Отказ, Расшифровка);
		КонецЕсли;
		Если ЭтаФорма.КомиссияБУ Тогда
			ПереносНастроекПоРегистру("НастройкиУчетаКомиссии", Перечисления.ВидыУчета.БухгалтерскийУчет, , Отказ, Расшифровка);
		КонецЕсли;
		Если ЭтаФорма.КомиссияНУ Тогда
			ПереносНастроекПоРегистру("НастройкиУчетаКомиссии", Перечисления.ВидыУчета.НалоговыйУчет, , Отказ, Расшифровка);
		КонецЕсли;
		
		Если ЭтаФорма.ЗакрытиеЕПС Тогда
			ПереносНастроекПоРегистру("НастройкиЗакрытияБухгалтерскихСчетов", Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет, , Отказ, Расшифровка);
		КонецЕсли;
		Если ЭтаФорма.ЗакрытиеБУ Тогда
			ПереносНастроекПоРегистру("НастройкиЗакрытияБухгалтерскихСчетов", Перечисления.ВидыУчета.БухгалтерскийУчет, , Отказ, Расшифровка);
		КонецЕсли;
		Если ЭтаФорма.ЗакрытиеНУ Тогда
			ПереносНастроекПоРегистру("НастройкиЗакрытияБухгалтерскихСчетов", Перечисления.ВидыУчета.НалоговыйУчет, , Отказ, Расшифровка);
		КонецЕсли;
		
	Если Отказ Тогда 
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию(); 
		Адрес_Расшифровка = ПоместитьВоВременноеХранилище(Расшифровка, УникальныйИдентификатор); 
	КонецЕсли; 
	
	Если Расшифровка <> Неопределено И НЕ Отказ Тогда
		СформироватьОтчетОПроделанныхОперациях(Расшифровка);  
		ЭтаФорма.ТекущийЭлемент = Элементы.Отчет;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДетализироватьПриИзменении(Элемент)
	
	ЭтаФорма.Элементы.НастройкиДетализации.Видимость = ЭтаФорма.Детализировать;
		
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьНастройкиПереноса(СписокПараметров)
	
	Если СписокПараметров = Неопределено Тогда 
		ВестиБухгалтерскийУчет = Ложь;
		ВестиЕдиныйБухгалтерскийУчет = Ложь;
		ВестиНалоговыйУчет = Ложь;
		ЭтоОдинКлиент = Ложь;
	Иначе 
		ВестиБухгалтерскийУчет = СписокПараметров.ВестиБухгалтерскийУчет;
		ВестиЕдиныйБухгалтерскийУчет = СписокПараметров.ВестиЕдиныйБухгалтерскийУчет;
		ВестиНалоговыйУчет = СписокПараметров.ВестиНалоговыйУчет;		
		ЭтоОдинКлиент = (СписокПараметров.КлиентДонор = СписокПараметров.КлиентРеципиент);
	Конецесли;	
		
	ЭтаФорма.Общие = Истина;
	
	ЭтаФорма.ПоВидуЕПС = ВестиЕдиныйБухгалтерскийУчет;
	ЭтаФорма.ПоВидуБУ = ВестиБухгалтерскийУчет;
	ЭтаФорма.ПоВидуНУ = ВестиНалоговыйУчет;
	
	ЭтаФорма.АктивыЕПС = ВестиЕдиныйБухгалтерскийУчет;
	ЭтаФорма.АктивыБУ = ВестиБухгалтерскийУчет;
	ЭтаФорма.АктивыНУ = ВестиНалоговыйУчет;
	
	ЭтаФорма.КомиссияЕПС = ВестиЕдиныйБухгалтерскийУчет;
	ЭтаФорма.КомиссияБУ = ВестиБухгалтерскийУчет;
	ЭтаФорма.КомиссияНУ = ВестиНалоговыйУчет;
	
	ЭтаФорма.ЗакрытиеЕПС = ВестиЕдиныйБухгалтерскийУчет;
	ЭтаФорма.ЗакрытиеБУ = ВестиБухгалтерскийУчет;
	ЭтаФорма.ЗакрытиеНУ = ВестиНалоговыйУчет;
	
	ЭтаФорма.АктивыПоСрочности = ВестиЕдиныйБухгалтерскийУчет;
	
	Если ВестиЕдиныйБухгалтерскийУчет И Не ЭтоОдинКлиент Тогда 
		ЭтаФорма.ПереопределениеКлассификации = Истина;
	Иначе	
		ЭтаФорма.ПереопределениеКлассификации = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьДоступностьНастроекПереноса(СписокПараметров)
	
	Если СписокПараметров = Неопределено Тогда 
		ВестиБухгалтерскийУчет = Ложь;
		ВестиЕдиныйБухгалтерскийУчет = Ложь;
		ВестиНалоговыйУчет = Ложь;
		ЭтоОдинКлиент = Ложь;
	Иначе 
		ВестиБухгалтерскийУчет = СписокПараметров.ВестиБухгалтерскийУчет;
		ВестиЕдиныйБухгалтерскийУчет = СписокПараметров.ВестиЕдиныйБухгалтерскийУчет;
		ВестиНалоговыйУчет = СписокПараметров.ВестиНалоговыйУчет;		
		ЭтоОдинКлиент = (СписокПараметров.КлиентДонор = СписокПараметров.КлиентРеципиент);
	Конецесли;	
		
	ЭтаФорма.Элементы.ПоВидуЕПС.Доступность = ВестиЕдиныйБухгалтерскийУчет;
	ЭтаФорма.Элементы.ПоВидуБУ.Доступность = ВестиБухгалтерскийУчет;
	ЭтаФорма.Элементы.ПоВидуНУ.Доступность = ВестиНалоговыйУчет;
	
	ЭтаФорма.Элементы.АктивыЕПС.Доступность = ВестиЕдиныйБухгалтерскийУчет;
	ЭтаФорма.Элементы.АктивыБУ.Доступность = ВестиБухгалтерскийУчет;
	ЭтаФорма.Элементы.АктивыНУ.Доступность = ВестиНалоговыйУчет;
	
	ЭтаФорма.Элементы.КомиссияЕПС.Доступность = ВестиЕдиныйБухгалтерскийУчет;
	ЭтаФорма.Элементы.КомиссияБУ.Доступность = ВестиБухгалтерскийУчет;
	ЭтаФорма.Элементы.КомиссияНУ.Доступность = ВестиНалоговыйУчет;
	
	ЭтаФорма.Элементы.ЗакрытиеЕПС.Доступность = ВестиЕдиныйБухгалтерскийУчет;
	ЭтаФорма.Элементы.ЗакрытиеБУ.Доступность = ВестиБухгалтерскийУчет;
	ЭтаФорма.Элементы.ЗакрытиеНУ.Доступность = ВестиНалоговыйУчет;
	
	ЭтаФорма.Элементы.АктивыПоСрочности.Доступность = ВестиЕдиныйБухгалтерскийУчет;
		
	Если ВестиЕдиныйБухгалтерскийУчет И Не ЭтоОдинКлиент Тогда 
		ЭтаФорма.Элементы.ПереопределениеКлассификации.Доступность = Истина;
	Иначе	
		ЭтаФорма.Элементы.ПереопределениеКлассификации.Доступность = Ложь;
	КонецЕсли;	
	
	ЭтаФорма.Элементы.ОграничениеПоВидуАктива.Доступность = Ложь;
	ЭтаФорма.ОграничениеПоВидуАктива = Ложь;
	Элементы.УчетныйАктив.Видимость = ЭтаФорма.ОграничениеПоВидуАктива;
	
	Если ВестиБухгалтерскийУчет ИЛИ ВестиНалоговыйУчет Тогда 
		ЭтаФорма.Элементы.ОграничениеПоВидуАктива.Доступность = Истина;
	КонецЕсли; 
	
	Если ЭтаФорма.ЭтоНовыйСчетДУ Тогда 
		ЭтаФорма.Элементы.ФормаПодтвердитьПереносИЗакрыть.Доступность = Истина; 
		ЭтаФорма.Элементы.ФормаРазброкирроватьНастройки.Доступность = Истина; 
		ЭтаФорма.Элементы.СкопироватьНастройкиБЭК.Доступность = Ложь;
		ЭтаФорма.Элементы.СкопироватьНастройкиБУХ.Доступность = Ложь;
	Иначе
		ЭтаФорма.Элементы.ФормаПодтвердитьПереносИЗакрыть.Доступность = Ложь;
		ЭтаФорма.Элементы.ФормаРазброкирроватьНастройки.Доступность = Ложь; 
		ЭтаФорма.Элементы.СкопироватьНастройкиБЭК.Доступность = Истина;
		ЭтаФорма.Элементы.СкопироватьНастройкиБУХ.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОграничениеПоВидуАктиваПриИзменении(Элемент)
	
	Если ОграничениеПоВидуАктива Тогда 
		ЭтаФорма.Элементы.УчетныйАктив.Видимость = Истина; 
		
		//снимем все флажки кроме Активы НУ и БУ  
		ЭтаФорма.Общие = Ложь;
		ЭтаФорма.ПоВидуЕПС = Ложь;
		ЭтаФорма.ПоВидуБУ = Ложь;
		ЭтаФорма.ПоВидуНУ = Ложь;
	    ЭтаФорма.АктивыЕПС = Ложь;
		ЭтаФорма.АктивыПоСрочности = Ложь;
		ЭтаФорма.ПереопределениеКлассификации = Ложь;
		ЭтаФорма.КомиссияЕПС = Ложь;
		ЭтаФорма.КомиссияБУ = Ложь;
		ЭтаФорма.КомиссияНУ = Ложь;
		ЭтаФорма.ЗакрытиеЕПС = Ложь;
		ЭтаФорма.ЗакрытиеБУ = Ложь;
		ЭтаФорма.ЗакрытиеНУ = Ложь;
	Иначе
		ЭтаФорма.Элементы.УчетныйАктив.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПереносБЭКОфис

&НаСервере
Процедура ДобавитьРегистрНастроекНаСервере(РегистрМД)

	ЭтаФорма.РегистрыНастроек.Добавить(РегистрМД.Имя, РегистрМД.Синоним, Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаУстановитьОтметкиВсехНастроек(Команда)
	
	ЭтаФорма.РегистрыНастроек.ЗаполнитьПометки(Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьОтметкиВсехНастроек(Команда)

	ЭтаФорма.РегистрыНастроек.ЗаполнитьПометки(Ложь);	
	
КонецПроцедуры  


&НаСервере
Процедура СкопироватьНастройкиНаСервере(КопируемыеРегистры)

	Отказ = Ложь;
		
	Если ПустаяСтрока(Адрес_Расшифровка) Тогда
		Расшифровка = Новый Структура;   
	Иначе
		Расшифровка = ПолучитьИзВременногоХранилища(Адрес_Расшифровка);
	КонецЕсли;
	
	СкопироватьНастройки(КопируемыеРегистры, Расшифровка, Отказ);
	
	Если Расшифровка <> Неопределено И НЕ Отказ Тогда
		СформироватьОтчетОПроделанныхОперациях(Расшифровка);  
		ЭтаФорма.ТекущийЭлемент = Элементы.Отчет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьНастройкиБЭК(Команда)
	
	Если НЕ ПроверитьПараметрыПереноса() Тогда
		Возврат;
	КонецЕсли;
	
	КопируемыеРегистры = Новый СписокЗначений;
		
	Для Каждого РегистрНастроек Из ЭтаФорма.РегистрыНастроек Цикл
		Если РегистрНастроек.Пометка Тогда
			КопируемыеРегистры.Добавить(РегистрНастроек.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если КопируемыеРегистры.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран ни один регистр с настройками", , "РегистрыНастроек");
		Возврат;
	ИначеЕсли Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;	
	

	СкопироватьНастройкиНаСервере(КопируемыеРегистры);
	
	Если ПодтверждениеПереноса Тогда
		ЭтаФорма.НастройкиБЭКПеренесены = Истина;
		Элементы.НастройкиБЭКПеренесены.ЦветТекста = WebЦвета.Зеленый;
		Элементы.СкопироватьНастройкиБЭК.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры


//процедуры и функции, перенесенные из модуля внешней обработки _КопированиеНастроекСчетаДоверительногоУправления
// сделал ро образцу _ПереносНастроекБухгалтерскогоУчета: вся логика в модуле формы. 

&НаСервере
Процедура СкопироватьНастройки(КопируемыеРегистры, Расшифровка, Отказ) Экспорт 
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем настройки источника
	
	КопируемыеНастройки = Новый Соответствие;
	
	Для Каждого РегистрНастроек Из КопируемыеРегистры Цикл
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	*
			|ИЗ
			|	#РегистрНастроек КАК РегистрНастроек
			|ГДЕ
			|	&ФильтрЗаписей");
		
		ПолеПриемника = ПолучитьПолеПриемникаРегистраНастроек(РегистрНастроек.Значение);
		
		Если Метаданные.РегистрыСведений[РегистрНастроек.Значение].ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#РегистрНастроек",
				СтрШаблон("РегистрСведений.%1", РегистрНастроек.Значение));
					
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрЗаписей",
				СтрШаблон("(%1 = &СчетДоверительногоУправления)", ПолеПриемника));
					
		Иначе
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "#РегистрНастроек",
				СтрШаблон("РегистрСведений.%1.СрезПоследних(&ДатаНастроек, %2 = &СчетДоверительногоУправления)",
					РегистрНастроек.Значение,
					ПолеПриемника));
					
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФильтрЗаписей", "ИСТИНА");
			
		КонецЕсли;
		
		//Запрос.УстановитьПараметр("ДатаНастроек",					ЭтотОбъект.ДатаНастроек);	
		//Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.Источник);	

		Запрос.УстановитьПараметр("ДатаНастроек",					ДатаВзятия);	
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДонор);	
		
		
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		
		КопируемыеНастройки.Вставить(РегистрНастроек.Значение, ВыборкаЗапроса);
		
	КонецЦикла;
	
	// Добавляем их в приемники	
	
	//приёмник будет один.
	//Для Каждого СтрокаПриемника Из ЭтотОбъект.СчетаДоверительногоУправления Цикл    
	
	// обернем в транзакцию  
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);

		ОрганизацияПриемника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетРеципиент, "Организация");			
		
		Для Каждого РегистрНастроек Из КопируемыеРегистры Цикл
			
			ПолеПриемника = ПолучитьПолеПриемникаРегистраНастроек(РегистрНастроек.Значение);
			
			СвойстваПриемника = Новый Структура;
			СвойстваПриемника.Вставить("Период",		ДатаУстановки);
			СвойстваПриемника.Вставить("Организация",	ОрганизацияПриемника);
			СвойстваПриемника.Вставить(ПолеПриемника,	СчетРеципиент);
			
			ИсключаяСвойства = ИсключаемыеИзКопированияСвойстваРегистраНастроек(РегистрНастроек.Значение);
			
			ВыборкаНастроек = КопируемыеНастройки[РегистрНастроек.Значение];
			ВыборкаНастроек.Сбросить();
			
			Пока ВыборкаНастроек.Следующий() Цикл
				
				//ОшибкаКопирования	= Ложь;
				ТекстОшибки			= "";
				
				НоваяНастройка = РегистрыСведений[РегистрНастроек.Значение].СоздатьМенеджерЗаписи();
				
				ЗаполнитьЗначенияСвойств(НоваяНастройка, ВыборкаНастроек, , ИсключаяСвойства);
				ЗаполнитьЗначенияСвойств(НоваяНастройка, СвойстваПриемника);
				
				Попытка
					//НоваяНастройка.Записать(Ложь);
				Исключение
					//ОшибкаКопирования = Истина;
					ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					Отказ = Истина;
				КонецПопытки;
				
				ДобавитьРасшифровкуОперации(Расшифровка, СчетРеципиент, РегистрНастроек.Значение, ВыборкаНастроек, СвойстваПриемника, ИсключаяСвойства, Отказ, ТекстОшибки);
				
			КонецЦикла;
				
		КонецЦикла;
		
	Если Отказ Тогда 
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();  
		Адрес_Расшифровка = ПоместитьВоВременноеХранилище(Расшифровка, УникальныйИдентификатор); 
	КонецЕсли;
		
	
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПолеПриемникаРегистраНастроек(ИмяРегистра)

	Если ИмяРегистра = "НастройкиРасчетаБенчмарков"
		Или ИмяРегистра = "НастройкиРасчетаПлановойДоходности"
	Тогда
	
		ПолеПриемника = "СубъектАналитики";	
		
	ИначеЕсли ИмяРегистра = "НастройкиРасчетаРыночнойСтавкиПоВидамАктивов"
				Или ИмяРегистра = "СоставИНастройкиОтчетов"
	Тогда
		
		ПолеПриемника = "Субъект";	
		
	ИначеЕсли ИмяРегистра = "ЗначенияДополнительныхСведений" Тогда
		
		ПолеПриемника = "Объект"; 
		
	ИначеЕсли ИмяРегистра = "ПереопределениеКлассификацииУчетныхАктивовЦБ" Тогда 
		
		ПолеПриемника = "Клиент";
		
	Иначе
		
		ПолеПриемника = "СчетДоверительногоУправления";
		
	КонецЕсли;
	
	Если Метаданные.РегистрыСведений[ИмяРегистра].Измерения.Найти(ПолеПриемника) = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Регистр сведений ""%1"" не содержит измерения ""%2""", ИмяРегистра, ПолеПриемника);	
	КонецЕсли;
	
	Возврат ПолеПриемника;	
	
КонецФункции

&НаСервере
Функция ИсключаемыеИзКопированияСвойстваРегистраНастроек(ИмяРегистра)
	
	Если ИмяРегистра = "НастройкиРасчетаВознагражденияУправляющего" Тогда
		ИсключаемыеСвойства = "Основание";	
	Иначе	
		ИсключаемыеСвойства = Неопределено;
	КонецЕсли;
	
	Возврат ИсключаемыеСвойства;	
	
КонецФункции

&НаСервере
Процедура ДобавитьРасшифровкуОперации(Расшифровка, Приемник, ИмяРегистра, НастройкиИсточника, СвойстваПриемника, ИсключаяСвойства, Ошибка, ТекстОшибки)
	
	Если Не Расшифровка.Свойство("Операции") Тогда
		Расшифровка.Вставить("Операции", Новый Массив);
	КонецЕсли;	
	
	// Группа операций
	
	ИмяГруппыОпераций = ?(Ошибка, "Ошибки", ?(ПодтверждениеПереноса, "Скопированные настройки", "Предлагаемые к копированию настройки"));
	
	ГруппаОпераций = НайтиРасшифровкуОперации(Расшифровка.Операции, ИмяГруппыОпераций);
	Если ГруппаОпераций = Неопределено Тогда
		ГруппаОпераций = РаботаСДокументами.ДобавитьРасшифровкуОперации(Расшифровка, ИмяГруппыОпераций, , , Истина);	
	КонецЕсли;
		
	// Приемник
	
	ОперацияПриемника = НайтиРасшифровкуОперации(ГруппаОпераций.Операции, Приемник);
	Если ОперацияПриемника = Неопределено Тогда
		ОперацияПриемника = РаботаСДокументами.ДобавитьРасшифровкуОперации(ГруппаОпераций, Приемник, , , Истина);	
	КонецЕсли;
	
	// Регистр
	
	СинонимРегистра = Метаданные.РегистрыСведений[ИмяРегистра].Синоним;
	
	ОперацииРегистра = НайтиРасшифровкуОперации(ОперацияПриемника.Операции, СинонимРегистра);
	Если ОперацииРегистра = Неопределено Тогда
		
		ТаблицаНастроек = Новый ТаблицаЗначений;
		Для Каждого Колонка Из НастройкиИсточника.Владелец().Колонки Цикл
			ТаблицаНастроек.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);		
		КонецЦикла;
		Если Ошибка Тогда
			ТаблицаНастроек.Колонки.Добавить("Ошибка", Новый ОписаниеТипов("Строка"));	
		КонецЕсли;
		
		ОперацииРегистра = РаботаСДокументами.ДобавитьРасшифровкуРезультатаОперации(ОперацияПриемника, СинонимРегистра, ТаблицаНастроек);	
		
	КонецЕсли;
	
	// Настройка
	
	ОперацияРегистра = ОперацииРегистра.Операции.Добавить();
	
	ЗаполнитьЗначенияСвойств(ОперацияРегистра, НастройкиИсточника, , ИсключаяСвойства);
	ЗаполнитьЗначенияСвойств(ОперацияРегистра, СвойстваПриемника);
	
	Если Ошибка Тогда
		ОперацияРегистра.Ошибка = ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиРасшифровкуОперации(Операции, ИмяОперации)
	
	Для Каждого Операция Из Операции Цикл
		Если Операция.Имя = ИмяОперации Тогда
			Возврат Операция;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Неопределено
	
КонецФункции

&НаСервере
Процедура СформироватьОтчетОПроделанныхОперациях(Расшифровка)
	
	// Если есть ошибки, то их отобразим в начале
	
	Если Расшифровка.Свойство("Операции") И Расшифровка.Операции.Количество() > 1 Тогда
		РасшифровкаОшибок = НайтиРасшифровкуОперации(Расшифровка.Операции, "Ошибки");
		Если РасшифровкаОшибок <> Неопределено Тогда
			Расшифровка.Операции.Удалить(Расшифровка.Операции.Найти(РасшифровкаОшибок));
			Расшифровка.Операции.Вставить(0, РасшифровкаОшибок);	
		КонецЕсли;
	КонецЕсли;	
	
	// Формируем табличный документ
	
	ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент();		
	ПараметрыВывода.Вставить("СобственныйФорматСтрок", Истина);
	
	Если Расшифровка.Свойство("Операции") Тогда 
		РаботаСДокументами.СформироватьРасшифровкуОперации(Расшифровка, ПараметрыВывода);
	КонецЕсли;
	
	// Разворачиваем строки до нужного уровня
	ПараметрыВывода.ДокументРезультат.ПоказатьУровеньГруппировокСтрок(3);

	Отчет = ПараметрыВывода.ДокументРезультат;
	
КонецПроцедуры

&НаКлиенте
Процедура РазброкироватьНастройки(Команда)
	
	ПодтверждениеПереноса = Истина;
	Элементы.ФормаПодтвердитьПереносИЗакрыть.Доступность = Ложь;
	Элементы.БЭК.Доступность = Истина;
	Элементы.БУХ.Доступность = Истина;
	Элементы.СкопироватьНастройкиБЭК.Доступность = Истина;
	Элементы.СкопироватьНастройкиБУХ.Доступность = Истина;
	
КонецПроцедуры


#КонецОбласти
